Repository: abdillahmubarok/plugin-almoeid-wp
Catalog: languages/almoe-*-oauth-*.po
Languages: id_id

source: Incomplete user data received from ALMOE ID server.
id_id: Data pengguna tidak lengkap diterima dari server ALMOE ID.

source: Auto-registration is disabled. Please contact the administrator.
id_id: Pendaftaran otomatis dinonaktifkan. Silakan hubungi administrator.

source: Invalid authentication attempt. Please try again.
id_id: Percobaan autentikasi tidak valid. Silakan coba lagi.

source: Authentication Error
id_id: Kesalahan Autentikasi

source: Failed to authenticate with ALMOE ID. Please try again.
id_id: Gagal melakukan autentikasi dengan ALMOE ID. Silakan coba lagi.

source: Failed to retrieve user information. Please try again.
id_id: Gagal mengambil informasi pengguna. Silakan coba lagi.

source: Settings
id_id: Pengaturan

source: User Mapping
id_id: Pemetaan Pengguna

source: Logs
id_id: Log

source: Login with ALMOE ID
id_id: Masuk dengan ALMOE ID

source: General Settings
id_id: Pengaturan Umum

source: Connection Settings
id_id: Pengaturan Koneksi

source: User Settings
id_id: Pengaturan Pengguna

source: Appearance Settings
id_id: Pengaturan Tampilan

source: Enable ALMOE ID Login
id_id: Aktifkan Login ALMOE ID

source: OAuth Endpoints
id_id: Endpoint OAuth

source: Auto Register Users
id_id: Daftarkan Pengguna Otomatis

source: Default User Role
id_id: Peran Pengguna Default

source: Button Text
id_id: Teks Tombol

source: Settings Saved
id_id: Pengaturan Disimpan

source: Configure general settings for ALMOE ID OAuth integration.
id_id: Konfigurasikan pengaturan umum untuk integrasi ALMOE ID OAuth.

source: Configure ALMOE ID OAuth server connection settings.
id_id: Konfigurasikan pengaturan koneksi server ALMOE ID OAuth.

source: Test Connection
id_id: Uji Koneksi

source: Auto-Configure Endpoints
id_id: Konfigurasi Otomatis Endpoint

source: Configure how users are created and managed.
id_id: Konfigurasikan bagaimana pengguna dibuat dan dikelola.

source: Configure the appearance of the ALMOE ID login button.
id_id: Konfigurasikan tampilan tombol login ALMOE ID.

source: Enable ALMOE ID OAuth authentication
id_id: Aktifkan autentikasi ALMOE ID OAuth

source: Enable or disable ALMOE ID authentication for this site.
id_id: Aktifkan atau nonaktifkan autentikasi ALMOE ID untuk situs ini.

source: Client ID provided by ALMOE ID server.
id_id: Client ID yang disediakan oleh server ALMOE ID.

source: Client Secret provided by ALMOE ID server.
id_id: Client Secret yang disediakan oleh server ALMOE ID.

source: Authorization Endpoint
id_id: Endpoint Otorisasi

source: Token Endpoint
id_id: Endpoint Token

source: User Info Endpoint
id_id: Endpoint Info Pengguna

source: Discovery URL
id_id: URL Discovery

source: OAuth endpoints for ALMOE ID server. These can be auto-configured if the server supports discovery.
id_id: Endpoint OAuth untuk server ALMOE ID. Ini dapat dikonfigurasi secara otomatis jika server mendukung discovery.

source: Automatically register new users
id_id: Otomatis mendaftarkan pengguna baru

source: If enabled, new users will be automatically registered when they authenticate with ALMOE ID.
id_id: Jika diaktifkan, pengguna baru akan otomatis didaftarkan saat mereka melakukan autentikasi dengan ALMOE ID.

source: Default role assigned to new users registered through ALMOE ID OAuth.
id_id: Peran default yang ditetapkan untuk pengguna baru yang terdaftar melalui ALMOE ID OAuth.

source: Text displayed on the ALMOE ID login button.
id_id: Teks yang ditampilkan pada tombol login ALMOE ID.

source: Button Preview
id_id: Pratinjau Tombol

source: Permission denied.
id_id: Izin ditolak.

source: Client ID and Client Secret are required.
id_id: Client ID dan Client Secret diperlukan.

source: Connection successful! Your client credentials are valid.
id_id: Koneksi berhasil! Kredensial client Anda valid.

source: Connection failed. Please check your client credentials and server settings.
id_id: Koneksi gagal. Silakan periksa kredensial client dan pengaturan server Anda.

source: Endpoints successfully configured from discovery document.
id_id: Endpoint berhasil dikonfigurasi dari dokumen discovery.

source: Failed to auto-configure endpoints. Please check the discovery URL.
id_id: Gagal mengkonfigurasi endpoint secara otomatis. Silakan periksa URL discovery.

source: OR
id_id: ATAU

source: Version %s
id_id: Versi %s

source: Configuration Instructions
id_id: Petunjuk Konfigurasi

source: To set up ALMOE ID OAuth integration:
id_id: Untuk mengatur integrasi ALMOE ID OAuth:

source: Register this site as a client in your ALMOE ID server
id_id: Daftarkan situs ini sebagai client di server ALMOE ID Anda

source: Set the redirect URI to:
id_id: Atur redirect URI ke:

source: Enter your Client ID and Client Secret in the settings
id_id: Masukkan Client ID dan Client Secret Anda di pengaturan

source: Configure the OAuth endpoints or use auto-discovery
id_id: Konfigurasikan endpoint OAuth atau gunakan auto-discovery

source: Test the connection to ensure everything works
id_id: Uji koneksi untuk memastikan semuanya berfungsi

source: Need Help?
id_id: Butuh Bantuan?

source: For questions, issues, or feature requests, please contact ALMOE ID support:
id_id: Untuk pertanyaan, masalah, atau permintaan fitur, silakan hubungi dukungan ALMOE ID:

source: Support Website
id_id: Situs Web Dukungan

source: Email Support
id_id: Dukungan Email

source: User Statistics
id_id: Statistik Pengguna

source: Total WordPress Users
id_id: Total Pengguna WordPress

source: Users Linked to ALMOE ID
id_id: Pengguna Tertaut ke ALMOE ID

source: Users Using ALMOE ID
id_id: Pengguna Menggunakan ALMOE ID

source: Search Users:
id_id: Cari Pengguna:

source: Search by name or email...
id_id: Cari berdasarkan nama atau email...

source: Name
id_id: Nama

source: ALMOE ID Status
id_id: Status ALMOE ID

source: Last Login
id_id: Login Terakhir

source: Actions
id_id: Tindakan

source: No users are currently linked with ALMOE ID.
id_id: Tidak ada pengguna yang saat ini tertaut dengan ALMOE ID.

source: Linked
id_id: Tertaut

source: Not linked
id_id: Tidak tertaut

source: %s ago
id_id: %s yang lalu

source: Never
id_id: Tidak pernah

source: Unlink
id_id: Putus tautan

source: About User Mapping
id_id: Tentang Pemetaan Pengguna

source: This page shows WordPress users who have linked their accounts with ALMOE ID.
id_id: Halaman ini menampilkan pengguna WordPress yang telah menautkan akun mereka dengan ALMOE ID.

source: Users can be linked to ALMOE ID in two ways:
id_id: Pengguna dapat ditautkan ke ALMOE ID dengan dua cara:

source: Existing WordPress users can log in with ALMOE ID
id_id: Pengguna WordPress yang sudah ada dapat masuk dengan ALMOE ID

source: New users can register through ALMOE ID authentication
id_id: Pengguna baru dapat mendaftar melalui autentikasi ALMOE ID

source: You can perform the following actions:
id_id: Anda dapat melakukan tindakan berikut:

source: Unlink: Disconnects a user from their ALMOE ID account. They can still log in with their WordPress credentials.
id_id: Putus tautan: Memutuskan pengguna dari akun ALMOE ID mereka. Mereka masih dapat masuk dengan kredensial WordPress mereka.

source: Note:
id_id: Catatan:

source: Unlinking a user does not delete their WordPress account or ALMOE ID account.
id_id: Memutus tautan pengguna tidak menghapus akun WordPress atau akun ALMOE ID mereka.

source: User ID:
id_id: ID Pengguna:

source: Event Type:
id_id: Jenis Kejadian:

source: All Events
id_id: Semua Kejadian

source: Login Success
id_id: Login Berhasil

source: Login Failure
id_id: Login Gagal

source: Date Range:
id_id: Rentang Tanggal:

source: Select dates...
id_id: Pilih tanggal...

source: No logs found matching your criteria.
id_id: Tidak ditemukan log yang sesuai dengan kriteria Anda.

source: Showing %1$d of %2$d log entry
id_id: Menampilkan %1$d dari %2$d entri log

source: Time
id_id: Waktu

source: User
id_id: Pengguna

source: Event
id_id: Kejadian

source: Details
id_id: Detail

source: IP Address
id_id: Alamat IP

source: User ID: %d (deleted)
id_id: ID Pengguna: %d (dihapus)

source: No user
id_id: Tidak ada pengguna

source: About Logs
id_id: Tentang Log

source: This page shows login activity logs for ALMOE ID authentication.
id_id: Halaman ini menampilkan log aktivitas login untuk autentikasi ALMOE ID.

source: You can filter logs by user, event type, and date range.
id_id: Anda dapat memfilter log berdasarkan pengguna, jenis kejadian, dan rentang tanggal.

source: Logs are automatically cleaned after 30 days to keep the database optimized.
id_id: Log secara otomatis dibersihkan setelah 30 hari untuk menjaga database tetap optimal.

source: Log Legend
id_id: Legenda Log

source: Login Success: User successfully authenticated with ALMOE ID
id_id: Login Berhasil: Pengguna berhasil diautentikasi dengan ALMOE ID

source: Login Failure: Authentication attempt failed
id_id: Login Gagal: Percobaan autentikasi gagal
